Autodesk.Revit.DB.ContourSetting.IsItemEnabled(Autodesk.Revit.DB.ContourSettingItem)
Check if a ContourSettingItem is enabled
item:
The contour setting item.
Returns:
True if the item is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025